Unit/src/Catalogs/ServiceExchangeHistory/ServiceExchangeHistory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ServiceExchangeHistory</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Time</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>QueryType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StatusCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ResourceAddress</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Headers</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>HeadersMD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Body</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>BodyMD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Unit/src/Catalogs/ServiceExchangeHistory/Forms/ItemForm/Module.bsl
// @strict-types

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ReadOnly = True;
	
	RealObject = FormDataToValue(Object, Type("CatalogObject.ServiceExchangeHistory")); //CatalogObject.ServiceExchangeHistory 
	HeadersValue = RealObject.Headers.Get();
	If TypeOf(HeadersValue) = Type("Map") Then
		For Each KeyValue In HeadersValue Do
			HeaderRow = HeadersTable.Add();
			HeaderRow.Key = String(KeyValue.Key);
			HeaderRow.Value = String(KeyValue.Value);
		EndDo;
	EndIf;
	
	If Object.Parent.IsEmpty() Then			// Query
		Items.GroupAnswer.Visible = False;
	Else									// Answer
		Items.GroupQuery.Visible = False;
		Items.HeadersGroup.Visible = False;
		Items.TryLoadBody.Visible = False;
		BodyString = String(RealObject.Body.Get());
	EndIf;
	
EndProcedure


&AtClient
Procedure TryLoadBody(Command)
	TryLoadBodyAtServer();
EndProcedure

&AtServer
Procedure TryLoadBodyAtServer()
	RealObject = FormDataToValue(Object, Type("CatalogObject.ServiceExchangeHistory")); //CatalogObject.ServiceExchangeHistory 
	BodyString = String(RealObject.Body.Get());
EndProcedure
